wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
    FW_Common::SetMode(newMode);
}

// Handles events when trigger is pulled/held
void TriggerFire()
{
    if(!FW_Common::buttons.offScreen) {
        if(!OF_FFB::triggerHeld) {
            if(FW_Common::buttons.analogOutput) // this should only ever be gamepad outputs
                Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
            else switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                default: break;
            }
        }

        if(!OF_Serial::serialMode && 
           !bitRead(FW_Common::buttons.debounced, FW_Const::BtnIdx_Start) &&
           !bitRead(FW_Common::buttons.debounced, FW_Const::BtnIdx_Select))
            OF_FFB::FFBOnScreen();
    // We're shooting outside of the screen boundaries!
    } else {  
        // If we are in offscreen button mode (and aren't dragging a shot offscreen)
        if(!OF_FFB::triggerHeld) {
            if(FW_Common::buttons.analogOutput) // always uses the same button
                Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
            else switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType2) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                default: break;
            }

            FW_Common::triggerPressedOffscreen = true;
        }

        if(!OF_Serial::serialMode) OF_FFB::FFBOffScreen();
    }
    OF_FFB::triggerHeld = true;
}

// Handles events when trigger is released
void TriggerNotFire()
{
    if(OF_FFB::triggerHeld) {
        if(FW_Common::buttons.analogOutput)
            Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
        else if(FW_Common::triggerPressedOffscreen) {
            switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType2) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                default: break;
            }
            FW_Common::triggerPressedOffscreen = false;
        } else {
            switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                default: break;
            }
        }
    }

    OF_FFB::triggerHeld = false;

    if(!OF_Serial::serialMode) OF_FFB::FFBRelease();
}

#ifdef USES_ANALOG
void AnalogStickPoll()
{
    int analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
    int analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
    
    if(OF_Prefs::settings[OF_Const::analogMode] == OF_Const::analogModeStick) {
        // -------- 可配置死区（0–30%）：以中心为基准 --------
        // 读取百分比（由暂停菜单写入），限制在 0–30 之间
        uint32_t dzPercent = 0;
        if (OF_Const::settingsTypesCount > OF_Const::analogDeadzone) {
            dzPercent = OF_Prefs::settings[OF_Const::analogDeadzone];
        }
        if (dzPercent > 30) dzPercent = 30;

        // 轻量滤波（IIR），抑制 ADC 抖动导致的“跳动”
        // 只影响 analogX/analogY（左摇杆），不影响摄像头/IR 映射
        static int32_t filtX = ANALOG_STICK_CENTER_X;
        static int32_t filtY = ANALOG_STICK_CENTER_Y;
        if (FW_Common::analogCenterJustCalibrated) {
            filtX = analogValueX;
            filtY = analogValueY;
            FW_Common::analogCenterJustCalibrated = false;
        } else {
            // alpha = 1/5 ≈ 0.2
            filtX = (filtX * 4 + analogValueX) / 5;
            filtY = (filtY * 4 + analogValueY) / 5;
        }

        // 应用用户可调的中心偏移（ADC 单位，可正可负），始终从 settings 读取
        int32_t offsetX = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetX];
        int32_t offsetY = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetY];

        int32_t adjX = filtX + offsetX;
        int32_t adjY = filtY + offsetY;

        // 限制在 ADC 合法范围内
        if (adjX < ANALOG_STICK_MIN_X) adjX = ANALOG_STICK_MIN_X;
        if (adjX > ANALOG_STICK_MAX_X) adjX = ANALOG_STICK_MAX_X;
        if (adjY < ANALOG_STICK_MIN_Y) adjY = ANALOG_STICK_MIN_Y;
        if (adjY > ANALOG_STICK_MAX_Y) adjY = ANALOG_STICK_MAX_Y;

        // 按整个量程的一半计算死区范围（4095/2 ≈ 2048）
        int32_t halfRange = (ANALOG_STICK_MAX_X - ANALOG_STICK_MIN_X) / 2; // 理论上约 2047
        int32_t dzIn      = (int32_t)halfRange * (int32_t)dzPercent / 100; // ADC 单位（进入死区阈值）
        // 加一点回滞，避免在阈值附近来回“抖动切换”
        int32_t dzHyst    = halfRange / 50; // ~2%
        if (dzHyst < 8) dzHyst = 8;
        int32_t dzOut     = dzIn + dzHyst;  // 离开死区阈值

        int32_t dx = adjX - (int32_t)ANALOG_STICK_CENTER_X;
        int32_t dy = adjY - (int32_t)ANALOG_STICK_CENTER_Y;

