wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
        // 按轴独立死区 + 回滞（比“X/Y 同时在死区”更稳定）
        static bool inDeadX = true;
        static bool inDeadY = true;

        int32_t adx = abs(dx);
        int32_t ady = abs(dy);

        if (inDeadX) {
            if (adx > dzOut) inDeadX = false;
        } else {
            if (adx < dzIn) inDeadX = true;
        }

        if (inDeadY) {
            if (ady > dzOut) inDeadY = false;
        } else {
            if (ady < dzIn) inDeadY = true;
        }

        uint16_t outX = (uint16_t)(inDeadX ? ANALOG_STICK_CENTER_X : (int)adjX);
        uint16_t outY = (uint16_t)(inDeadY ? ANALOG_STICK_CENTER_Y : (int)adjY);
        Gamepad16.moveStick(outX, outY);
    } else {
        uint32_t newPos = 0;
        int32_t offX = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetX];
        int32_t offY = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetY];
        int32_t adjX = (int32_t)analogValueX + offX;
        int32_t adjY = (int32_t)analogValueY + offY;

        // TODO: need to consider inverted axis toggle, currently assumes axises are inverted by default
        if(adjY < (ANALOG_STICK_DEADZONE_Y_MIN-700))
            newPos = 2; // down
        else if(adjY > (ANALOG_STICK_DEADZONE_Y_MAX+700))
            newPos = 1; // up

        if(adjX < (ANALOG_STICK_DEADZONE_X_MIN-700))
            newPos |= 8; // right
        else if(adjX > (ANALOG_STICK_DEADZONE_X_MAX+700))
            newPos |= 4; // left

        switch(OF_Prefs::settings[OF_Const::analogMode]) {
        case OF_Const::analogModeDpad: Gamepad16.padUpdate(FW_Common::buttons.PadMaskConvert(newPos)); break;
        case OF_Const::analogModeKeys:
            if(FW_Common::aStickADCLastPos ^ newPos) {
                for(int i = 0; i < 4; ++i) {
                    if(FW_Common::aStickADCLastPos ^ newPos & 1 << i)
                        Keyboard.release(KEY_UP_ARROW-i);
                }
            }
            for(int i = 0; i < 4; ++i) {
                if(newPos & 1 << i)
                    Keyboard.press(KEY_UP_ARROW-i);
            }
            break;
        }
        FW_Common::aStickADCLastPos = newPos;
    }
        
}
#endif // USES_ANALOG

void SendEscapeKey()
{
    Keyboard.press(KEY_ESC);  // 696969 non corrisponde a HID_KEY_ESCAPE, ma lasciamo come impostato, boh ?
    Keyboard.report();
    delay(20);  // wait a bit so it registers on the PC.
    Keyboard.release(KEY_ESC); // 696969 non corrisponde a HID_KEY_ESCAPE, ma lasciamo come impostato, boh ?
    Keyboard.report();
    lastUSBpoll = millis();
}

// Simple Pause Menu scrolling function
// Bool determines if it's incrementing or decrementing the list
// LEDs update according to the setting being scrolled onto, if any.
void SetPauseModeSelection(const bool &isIncrement)
{
    if(isIncrement) {
        if(FW_Common::pauseModeSelection == FW_Const::PauseMode_EscapeSignal) {
            FW_Common::pauseModeSelection = FW_Const::PauseMode_AnalogCenterCal;
        } else {
            FW_Common::pauseModeSelection++;
            // If we use switches, and they ARE mapped to valid pins,
            // then skip over the manual toggle options.
            #ifdef USES_SWITCHES
                #ifdef USES_RUMBLE
                #ifdef PauseMode_RumbleFFToggle
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleFFToggle &&
                !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                    FW_Common::pauseModeSelection++;
                }
                #endif // PauseMode_RumbleFFToggle
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                (OF_Prefs::pins[OF_Const::rumbleSwitch] >= 0 || OF_Prefs::pins[OF_Const::rumblePin] == -1)) {
                    FW_Common::pauseModeSelection++;
                }
            #endif // USES_RUMBLE
                #ifdef USES_SOLENOID
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                (OF_Prefs::pins[OF_Const::solenoidSwitch] >= 0 || OF_Prefs::pins[OF_Const::solenoidPin] == -1)) {
                    FW_Common::pauseModeSelection++;
                }
            #endif // USES_SOLENOID
            if(FW_Common::pauseModeSelection == FW_Const::PauseMode_AutofireToggle &&
            (OF_Prefs::pins[OF_Const::autofireSwitch] >= 0 || !OF_Prefs::toggles[OF_Const::solenoid])) {
                FW_Common::pauseModeSelection++;
            }
                //wei134102 add start
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_ModeChange) {
                    // ModeChange is always visible
                }
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_LowButtonToggle) {
                    // LowButtonToggle is always visible
                }
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_LayoutToggle) {
                    // LayoutToggle is always visible
                }                                
                //wei134102 add end
            #else
                #ifdef USES_RUMBLE
                    #ifdef PauseMode_RumbleFFToggle
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleFFToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection++;
                    }
                    #endif // PauseMode_RumbleFFToggle                
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection++;
                    }
                #endif // USES_RUMBLE
                #ifdef USES_SOLENOID
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                    !(OF_Prefs::pins[OF_Const::solenoidPin] >= 0)) {
                        FW_Common::pauseModeSelection++;
                    }
                #endif // USES_SOLENOID
            #endif // USES_SWITCHES
        }
    } else {
        if(FW_Common::pauseModeSelection == FW_Const::PauseMode_AnalogCenterCal) {
            FW_Common::pauseModeSelection = FW_Const::PauseMode_EscapeSignal;
        } else {
            FW_Common::pauseModeSelection--;
            #ifdef USES_SWITCHES
                #ifdef USES_SOLENOID
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                    (OF_Prefs::pins[OF_Const::solenoidSwitch] >= 0 || OF_Prefs::pins[OF_Const::solenoidPin] == -1)) {
                        FW_Common::pauseModeSelection--;
                    }
                #endif // USES_SOLENOID
                #ifdef USES_RUMBLE
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                    (OF_Prefs::pins[OF_Const::rumbleSwitch] >= 0 || OF_Prefs::pins[OF_Const::rumblePin] == -1)) {
                        FW_Common::pauseModeSelection--;
                    }
                    #ifdef PauseMode_RumbleFFToggle
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleFFToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection--;
                    }
                    #endif // PauseMode_RumbleFFToggle                    
                #endif // USES_RUMBLE
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_AutofireToggle &&
                (OF_Prefs::pins[OF_Const::autofireSwitch] >= 0 || !OF_Prefs::toggles[OF_Const::solenoid])) {
                    FW_Common::pauseModeSelection--;
                }                
                //wei134102 add start
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_ModeChange) {
                    // ModeChange is always visible
                }
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_LayoutToggle) {
                    // LayoutToggle is always visible
                }                                
                //wei134102 add end
                if(FW_Common::pauseModeSelection == FW_Const::PauseMode_ModeChange) {
            #else
                #ifdef USES_SOLENOID
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_SolenoidToggle &&
                    !(OF_Prefs::pins[OF_Const::solenoidPin] >= 0)) {
                        FW_Common::pauseModeSelection--;
                    }
                #endif // USES_SOLENOID
                #ifdef USES_RUMBLE
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection--;
                    }

